#### `terraform plan` Success
<details><summary>Show Output</summary>

```
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/foreign-language-reader/infrastructure/runs/run-kbc8yyXSD9uHzaZb

Waiting for the plan to start...

Terraform v0.14.3
Configuring remote state backend...
Initializing Terraform configuration...
module.infrastructure.digitalocean_domain.main: Refreshing state... [id=foreignlanguagereader.com]
digitalocean_kubernetes_cluster.foreign_language_reader: Refreshing state... [id=2132b4c2-fd9e-496c-8419-a39da7d142f0]
module.infrastructure.tls_private_key.tls_private_key: Refreshing state... [id=96c5128d225c1725a7d5fda91c9f195dd1837181]
module.infrastructure.module.monitoring.random_password.fluent_elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.application_secret: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.elasticsearch_password: Refreshing state... [id=none]
module.infrastructure.module.api.random_password.truststore_password: Refreshing state... [id=none]
module.infrastructure.acme_registration.reg: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/acct/106949055]
module.infrastructure.aws_iam_user.github: Refreshing state... [id=foreign-language-reader-github]
module.infrastructure.module.content.aws_iam_user.spark: Refreshing state... [id=spark]
module.infrastructure.module.storybook.aws_s3_bucket.main: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_s3_bucket.main: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.content.aws_s3_bucket.content: Refreshing state... [id=foreign-language-reader-content]
module.infrastructure.acme_certificate.certificate: Refreshing state... [id=https://acme-v02.api.letsencrypt.org/acme/cert/048581440bbcef4defc3dc4efa4224416862]
module.infrastructure.aws_iam_access_key.github: Refreshing state... [id=AKIAQRKEJGTPHZFIVEWW]
module.infrastructure.module.content.aws_iam_access_key.spark: Refreshing state... [id=AKIAQRKEJGTPARQC5JMK]
module.infrastructure.module.nginx_ingress_prod.helm_release.nginx_ingress: Refreshing state... [id=nginx-ingress]
module.infrastructure.module.api.kubernetes_service.api: Refreshing state... [id=prod/api]
module.infrastructure.module.api.kubernetes_secret.application-secret: Refreshing state... [id=prod/application-secret]
module.infrastructure.module.api.kubernetes_secret.elasticsearch_credentials: Refreshing state... [id=prod/elasticsearch-credentials]
module.infrastructure.module.nginx_ingress_prod.kubernetes_secret.nginx_certificate: Refreshing state... [id=prod/nginx-certificate]
module.infrastructure.kubernetes_namespace.prod: Refreshing state... [id=prod]
module.infrastructure.module.api.kubernetes_horizontal_pod_autoscaler.api_autoscale: Refreshing state... [id=prod/api]
module.infrastructure.module.content.kubernetes_namespace.content: Refreshing state... [id=content]
module.infrastructure.module.monitoring.kubernetes_namespace.logging: Refreshing state... [id=logging]
module.infrastructure.kubernetes_namespace.qa: Refreshing state... [id=qa]
module.infrastructure.kubernetes_ingress.prod_ingress: Refreshing state... [id=prod/foreign-language-reader-ingress]
module.infrastructure.module.content.helm_release.spark: Refreshing state... [id=spark]
module.infrastructure.module.monitoring.helm_release.fluentd_elasticsearch: Refreshing state... [id=fluentd]
module.infrastructure.module.content.kubernetes_secret.spark_s3_creds: Refreshing state... [id=content/spark-s3-creds]
module.infrastructure.module.api.kubernetes_deployment.api: Refreshing state... [id=prod/api]
module.infrastructure.module.nginx_ingress_prod.digitalocean_record.kubernetes_subdomain_dns["api"]: Refreshing state... [id=126962116]
module.infrastructure.module.storybook.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E1RVJJFB4SD5MG]
module.infrastructure.module.frontend.aws_s3_bucket_policy.public_access: Refreshing state... [id=www.foreignlanguagereader.com]
module.infrastructure.module.storybook.aws_s3_bucket_policy.public_access: Refreshing state... [id=storybook.foreignlanguagereader.com]
module.infrastructure.module.frontend.aws_cloudfront_distribution.s3_distribution: Refreshing state... [id=E33TYMXRYMHHGW]
module.infrastructure.module.content.aws_iam_policy.spark_read: Refreshing state... [id=arn:aws:iam::037187302622:policy/spark-read-role]
module.infrastructure.module.storybook.digitalocean_record.subdomain: Refreshing state... [id=127348002]
module.infrastructure.module.storybook.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/storybook.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.frontend.digitalocean_record.subdomain: Refreshing state... [id=127348003]
module.infrastructure.module.frontend.aws_iam_policy.deploy: Refreshing state... [id=arn:aws:iam::037187302622:policy/www.foreignlanguagereader.com-deploy-role]
module.infrastructure.module.content.aws_iam_policy_attachment.spark_read: Refreshing state... [id=spark-read-role-attach]
module.infrastructure.module.storybook.aws_iam_policy_attachment.deploy: Refreshing state... [id=storybook.foreignlanguagereader.com-deploy-role-attach]
module.infrastructure.module.frontend.aws_iam_policy_attachment.deploy: Refreshing state... [id=www.foreignlanguagereader.com-deploy-role-attach]

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # digitalocean_kubernetes_cluster.foreign_language_reader will be updated in-place
  ~ resource "digitalocean_kubernetes_cluster" "foreign_language_reader" {
        id             = "2132b4c2-fd9e-496c-8419-a39da7d142f0"
        name           = "foreign-language-reader"
        tags           = [
            "prod",
        ]
        # (13 unchanged attributes hidden)

      ~ node_pool {
            id                = "12a755da-7985-4c6b-9634-94d74d772251"
          ~ max_nodes         = 3 -> 5
            name              = "worker-pool"
            tags              = []
            # (7 unchanged attributes hidden)
        }
    }

  # module.infrastructure.module.nginx_ingress_prod.data.kubernetes_service.nginx will be read during apply
  # (config refers to values not yet known)
 <= data "kubernetes_service" "nginx"  {
      ~ id                    = "prod/nginx-ingress-nginx-ingress" -> (known after apply)
      ~ load_balancer_ingress = [
          - {
              - hostname = ""
              - ip       = "157.230.196.161"
            },
        ] -> (known after apply)
      ~ spec                  = [
          - {
              - cluster_ip                  = "10.245.11.76"
              - external_ips                = []
              - external_name               = ""
              - external_traffic_policy     = "Local"
              - health_check_node_port      = 30162
              - load_balancer_ip            = ""
              - load_balancer_source_ranges = []
              - port                        = [
                  - {
                      - name        = "http"
                      - node_port   = 32061
                      - port        = 80
                      - protocol    = "TCP"
                      - target_port = "80"
                    },
                  - {
                      - name        = "https"
                      - node_port   = 32369
                      - port        = 443
                      - protocol    = "TCP"
                      - target_port = "443"
                    },
                ]
              - publish_not_ready_addresses = false
              - selector                    = {
                  - "app" = "nginx-ingress-nginx-ingress"
                }
              - session_affinity            = "None"
              - type                        = "LoadBalancer"
            },
        ] -> (known after apply)

      ~ metadata {
          - annotations      = {
              - "kubernetes.digitalocean.com/load-balancer-id" = "e078c608-8232-4aa3-93e7-5fc703f41c4c"
              - "meta.helm.sh/release-name"                    = "nginx-ingress"
              - "meta.helm.sh/release-namespace"               = "prod"
            } -> null
          ~ generation       = 0 -> (known after apply)
          - labels           = {
              - "helm.sh/chart" = "nginx-ingress-0.7.1"
            } -> null
            name             = "nginx-ingress-nginx-ingress"
          ~ resource_version = "220852" -> (known after apply)
          ~ self_link        = "/api/v1/namespaces/prod/services/nginx-ingress-nginx-ingress" -> (known after apply)
          ~ uid              = "570afa3c-6051-42d3-be70-bc1f358793fa" -> (known after apply)
            # (1 unchanged attribute hidden)
        }
    }

Plan: 0 to add, 1 to change, 0 to destroy.
```

</details>

*Workflow: `Test infrastructure plan`, Action: `hashicorpterraform-github-actions4`, Working Directory: `.`, Workspace: `default`*
